vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA156_DFP.pdsc
    <condition id="driver.display-common.condition_id">
      <require condition="allOf.driver.video-common, device=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.display-it6161.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.display-it6263.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.display-sn65dsi83.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.edma4.condition_id">
      <require condition="allOf.driver.edma_soc, device=MCXA156.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma_soc, device=MCXA156.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma_soc"/>
      <require condition="device.MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.edma_soc.condition_id">
      <require condition="allOf.driver.edma4, device=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.eim.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.ektf2k.condition_id">
      <require condition="allOf.device=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.eqdc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.erm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.flexcan.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.flexcan_edma.condition_id">
      <require condition="allOf.driver.edma4, device=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.flexio.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2c_master.condition_id">
      <require condition="allOf.driver.flexio, device_id=MCXA156.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexio, device_id=MCXA156.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
      <require condition="device_id.MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.flexio_mculcd.condition_id">
      <require condition="allOf.driver.flexio, device_id=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.flexio_mculcd_edma.condition_id">
      <require condition="allOf.driver.edma4, device=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi.condition_id">
      <require condition="allOf.driver.flexio, device_id=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi_edma.condition_id">
      <require condition="allOf.driver.edma4, device=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart.condition_id">
      <require condition="allOf.driver.flexio, device_id=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart_edma.condition_id">
      <require condition="allOf.driver.edma4, device=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.ft3267.condition_id">
      <require condition="allOf.device=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.ft5406.condition_id">
      <require condition="allOf.device=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.ft5406_rt.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, device=MCXA156.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpi2c, device=MCXA156.internal_condition">
      <require condition="anyOf.driver.lpi2c.internal_condition"/>
      <require condition="device.MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.ft6x06.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, device=MCXA156.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, device=MCXA156.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="device.MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.fxas21002cq.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.fxls8974cf.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.glikey.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.gpio.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.gt911.condition_id">
      <require condition="allOf.device=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.htu21d.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.i3c.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA156.internal_condition"/>
    </condition>
    <condition id="driver.i3c_edma.condition_id">
      <require condition="allOf.driver.edma4, driver.i3c, device=MCXA156.internal_condition"/>
    </condition>
