vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA156_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_legacy" Cversion="1.0.0" condition="component.mem_manager_legacy.condition_id">
      <description>Component mem_manager_legacy</description>
      <files>
        <file category="sourceC" name="components/mem_manager/fsl_component_mem_manager.c" projectpath="component/mem_manager"/>
        <file category="include" name="components/mem_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_light" Cversion="1.0.0" condition="component.mem_manager_light.condition_id">
      <description>Component mem_manager_light</description>
      <files>
        <file category="sourceC" name="components/mem_manager/fsl_component_mem_manager_light.c" projectpath="component/mem_manager"/>
        <file category="include" name="components/mem_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="messaging" Cversion="1.0.0" condition="component.messaging.condition_id">
      <description>Component messaging</description>
      <files>
        <file category="header" name="components/messaging/fsl_component_messaging.h" projectpath="component/messaging"/>
        <file category="sourceC" name="components/messaging/fsl_component_messaging.c" projectpath="component/messaging"/>
        <file category="include" name="components/messaging/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_offchip" Cversion="1.0.0" condition="component.mflash_offchip.condition_id">
      <description>mflash offchip</description>
      <files>
        <file category="doc" name="components/flash/mflash/component.mflash_offchip_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_onchip" Cversion="1.0.0" condition="component.mflash_onchip.condition_id">
      <description>mflash onchip</description>
      <RTE_Components_h>
#ifndef MFLASH_FILE_BASEADDR
#define MFLASH_FILE_BASEADDR 122880
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/flash/mflash/mflash_common.h" projectpath="flash/mflash"/>
        <file category="sourceC" name="components/flash/mflash/mflash_file.c" projectpath="flash/mflash"/>
        <file category="header" name="components/flash/mflash/mflash_file.h" projectpath="flash/mflash"/>
        <file category="sourceC" name="components/flash/mflash/mcxa/mflash_drv.c" projectpath="flash/mflash/mcxa"/>
        <file category="header" name="components/flash/mflash/mcxa/mflash_drv.h" projectpath="flash/mflash/mcxa"/>
        <file category="include" name="components/flash/mflash/"/>
        <file category="include" name="components/flash/mflash/mcxa/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_onchip_fmu" Cversion="1.0.0" condition="component.mflash_onchip_fmu.condition_id">
      <description>mflash onchip_fmu</description>
      <files>
        <file category="doc" name="components/flash/mflash/component.mflash_onchip_fmu_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer_adapter" Cversion="1.0.0" condition="component.ostimer_adapter.condition_id">
      <description>Component ostimer_adapter</description>
      <RTE_Components_h>
#ifndef TIMER_PORT_TYPE_OSTIMER
#define TIMER_PORT_TYPE_OSTIMER 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/timer/fsl_adapter_timer.h" projectpath="component/timer"/>
        <file category="sourceC" name="components/timer/fsl_adapter_ostimer.c" projectpath="component/timer"/>
        <file category="include" name="components/timer/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer_time_stamp_adapter" Cversion="1.0.0" condition="component.ostimer_time_stamp_adapter.condition_id">
      <description>Component ostimer time stamp adapter</description>
      <files>
        <file category="header" name="components/time_stamp/fsl_adapter_time_stamp.h" projectpath="component/time_stamp"/>
        <file category="sourceC" name="components/time_stamp/fsl_adapter_ostimer_time_stamp.c" projectpath="component/time_stamp"/>
        <file category="include" name="components/time_stamp/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="panic" Cversion="1.0.0" condition="component.panic.condition_id">
      <description>Component panic</description>
      <files>
        <file category="header" name="components/panic/fsl_component_panic.h" projectpath="component/panic"/>
        <file category="sourceC" name="components/panic/fsl_component_panic.c" projectpath="component/panic"/>
        <file category="include" name="components/panic/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="reset_adapter" Cversion="1.0.0" condition="component.reset_adapter.condition_id">
      <description>Component reset_adapter</description>
      <files>
        <file category="header" name="components/reset/fsl_adapter_reset.h" projectpath="component/reset"/>
        <file category="sourceC" name="components/reset/fsl_adapter_reset.c" projectpath="component/reset"/>
        <file category="include" name="components/reset/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager" Cversion="1.0.1" condition="component.serial_manager.condition_id">
      <description>Component serial_manager</description>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_manager.h" projectpath="component/serial_manager"/>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_internal.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_manager.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_spi" Cversion="1.0.0" condition="component.serial_manager_spi.condition_id">
      <description>Component serial_manager_spi</description>
      <RTE_Components_h>
        #ifndef SERIAL_PORT_TYPE_SPI
        #define SERIAL_PORT_TYPE_SPI 1
        #endif
        #ifndef SERIAL_PORT_TYPE_SPI_MASTER
        #define SERIAL_PORT_TYPE_SPI_MASTER 1
        #endif
        #ifndef SERIAL_PORT_TYPE_SPI_SLAVE
        #define SERIAL_PORT_TYPE_SPI_SLAVE 1
        #endif
        #ifndef SERIAL_MANAGER_NON_BLOCKING_MODE
        #define SERIAL_MANAGER_NON_BLOCKING_MODE 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_spi.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_spi.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo" Cversion="1.0.0" condition="component.serial_manager_swo.condition_id">
      <description>Component serial_manager_swo</description>
      <RTE_Components_h>
#ifndef SERIAL_PORT_TYPE_SWO
#define SERIAL_PORT_TYPE_SWO 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_swo.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_swo.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart" Cversion="1.0.0" condition="component.serial_manager_uart.condition_id">
      <description>Component serial_manager_uart</description>
      <RTE_Components_h>
#ifndef SERIAL_PORT_TYPE_UART
#define SERIAL_PORT_TYPE_UART 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_uart.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_uart.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual" Cversion="1.0.0" condition="component.serial_manager_virtual.condition_id">
      <description>Component serial_manager_virtual</description>
      <RTE_Components_h>
        #ifndef SSERIAL_PORT_TYPE_VIRTUAL
        #define SSERIAL_PORT_TYPE_VIRTUAL 1
        #endif
        #ifndef DEBUG_CONSOLE_TRANSFER_NON_BLOCKING
        #define DEBUG_CONSOLE_TRANSFER_NON_BLOCKING 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_virtual.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_virtual.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager" Cversion="1.0.0" condition="component.timer_manager.condition_id">
      <description>Component timer_manager</description>
      <files>
        <file category="header" name="components/timer_manager/fsl_component_timer_manager.h" projectpath="component/timer_manager"/>
        <file category="sourceC" name="components/timer_manager/fsl_component_timer_manager.c" projectpath="component/timer_manager"/>
        <file category="include" name="components/timer_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXA156_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MCXA156_cmsis</description>
      <files>
        <file category="header" name="devices/MCXA156/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MCXA156/MCXA156.h" projectpath="device"/>
        <file category="header" name="devices/MCXA156/MCXA156_features.h" projectpath="device"/>
        <file category="header" name="devices/MCXA156/MCXA156_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_ADC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_AOI.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_CAN.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_CDOG.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_CMC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_CRC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_CTIMER.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_DEBUGMAILBOX.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_DMA.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_EIM.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_EQDC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_ERM.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_FLEXIO.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_FMC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_FMU.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_FMUTEST.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_FREQME.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_GLIKEY.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_GPIO.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_I3C.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_INPUTMUX.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_LPCMP.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_LPDAC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_LPI2C.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_LPSPI.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_LPTMR.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_LPUART.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_MRCC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_OPAMP.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_OSTIMER.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_PORT.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_PWM.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_SCG.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_SPC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_SYSCON.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_TRDC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_USB.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_UTICK.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_VBAT.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_WAKETIMER.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_WUU.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA156/periph1/PERI_WWDT.h" projectpath="device/periph1"/>
        <file category="include" name="devices/MCXA156/"/>
        <file category="include" name="devices/MCXA156/periph1/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MCXA156/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXA156/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXA156_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXA156_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MCXA156.condition_id" category="linkerScript" name="devices/MCXA156/arm/MCXA156_flash.scf" projectpath="MCXA156/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MCXA156.condition_id" category="linkerScript" name="devices/MCXA156/arm/MCXA156_ram.scf" projectpath="MCXA156/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXA156.condition_id" category="linkerScript" name="devices/MCXA156/gcc/MCXA156_flash.ld" projectpath="MCXA156/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXA156.condition_id" category="linkerScript" name="devices/MCXA156/gcc/MCXA156_ram.ld" projectpath="MCXA156/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXA156.condition_id" category="linkerScript" name="devices/MCXA156/iar/MCXA156_flash.icf" projectpath="MCXA156/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXA156.condition_id" category="linkerScript" name="devices/MCXA156/iar/MCXA156_ram.icf" projectpath="MCXA156/iar"/>
      </files>
    </component>
